Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровУслуг</Name>
			<BasedOn>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныРулонов</xr:Item>
				<xr:Item>AccumulationRegister.Материалы</xr:Item>
				<xr:Item>AccumulationRegister.Рулоны</xr:Item>
				<xr:Item>InformationRegister.ЦеныМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС_В_томЧисле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалОсновы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МатериалОсновы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рулон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Рулоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Рулоны</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рулон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МатериалОсновы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатериалОсновы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Статусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вработе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебиторкаПросрочена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненаСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласованииЗаказчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеределкаЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
// @strict-types

&НаКлиенте
Процедура Расчитать()
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Цена*Элементы.Товары.ТекущиеДанные.Количество;
	Если Строка(Элементы.Товары.ТекущиеДанные.НДС) = "Без НДС" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = 0;
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "18%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.18;
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "20%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.2;
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "7%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.07;	
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "5%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.05;	
	ИначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "22%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.22;			
	КонецЕсли;
	Если Объект.НДС_В_томЧисле Тогда
		Элементы.Товары.ТекущиеДанные.Всего	= Элементы.Товары.ТекущиеДанные.Сумма;
	иначе	
		Элементы.Товары.ТекущиеДанные.Всего	= Элементы.Товары.ТекущиеДанные.Сумма+Элементы.Товары.ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	Объект.СуммаДокумента 	= Объект.Товары.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСтавкаНДСПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМатериалПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.МатериалОсновы= ПолучитьМатериалОсновы(ТекДанные.Материал);
	ТекДанные.Поставщик 	= ПолучитьПоставщика(ТекДанные.Материал);
КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалОсновы(Материал)
	  Возврат Материал.МатериалОсновы;
 КонецФункции
  
  &НаСервере
Функция ПолучитьПоставщика(Материал)
	  Возврат Материал.Поставщик;
  КонецФункции

&НаКлиенте
Процедура ПрисвоитьНомераРулонам(Команда)
	ПрисвоитьНомераРулонамНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерПоследнегоРулона()
	
	последНомер =0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерГода",Прав(Год(Объект.Дата),2)+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рулоны.Рулон КАК Рулон
		|ИЗ
		|	РегистрНакопления.Рулоны КАК Рулоны
		|ГДЕ
		|	Рулоны.Рулон ПОДОБНО &НомерГода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рулон УБЫВ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		последНомер = Число(Прав((ВыборкаДетальныеЗаписи.Рулон),4));
	КонецЦикла;
	
	последНомер = СтрЗаменить(последНомер,Символы.НПП,"");
	 
	 Возврат последНомер;
	 
КонецФункции	

&НаСервере
Процедура ПрисвоитьНомераРулонамНаСервере();
	последНомер = Число(ПолучитьНомерПоследнегоРулона());
	текГод 		= Прав(Строка(Год(Объект.Дата)),2);
	для каждого стрТЧ из Объект.Товары цикл
			Если Не ЗначениеЗаполнено(стрТЧ.Рулон) Тогда 
				Если последНомер=0 Тогда 
					стрТЧ.Рулон = текГод+"-0001";
					последНомер = 1;
				иначе
					последНомер = последНомер+1;
					кол = СтрДлина(последНомер);
					стрТЧ.Рулон = текГод+"-";
					кол = 4-кол;
					Если кол>0 Тогда 
						для к=1 по кол цикл
							стрТЧ.Рулон = стрТЧ.Рулон+"0";
						КонецЦикла;	
					КонецЕсли;
					стрТЧ.Рулон = стрТЧ.Рулон+последНомер;
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Не Объект.СуммаДокумента = Объект.Товары.Итог("Всего") Тогда 
		Объект.СуммаДокумента = Объект.Товары.Итог("Всего");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Статус) Тогда
		Если Объект.Статус = Перечисления.Статусы.Закрыт И Не РольДоступна("УУ") Тогда 
			ЭтаФорма.ТолькоПросмотр = Истина;
		иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	иначе	
		Объект.Статус 		= Перечисления.Статусы.Вработе;
		Модифицированность 	= Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалОсновы(Команда) 
	Для Каждого стрТч из Объект.Товары Цикл 
		 стрТч.МатериалОсновы = ПолучитьМатериалОсновы(стрТч.Материал);
	 КонецЦикла;	
	 Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент) 
	Расчитать();
КонецПроцедуры
